Статистика работы механизмов/Конфигурация/DataProcessors/_КонтрольИнвестиционныхДеклараций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_КонтрольИнвестиционныхДеклараций</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвестиционнаяДекларация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвестиционныеДекларации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьПлановыеОперации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДинамическийРасчетСтоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Претрейд</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭтоПретрейд</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеУчитывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидАктива</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БрокерРасчетныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Депозит</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДепозитныеВклады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЮрФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Рынок</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Купон</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Классификация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПогашенияДепозита</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВторойЧастиРЕПО</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаРЕПО</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СделкаСЦентральнымКонтрагентом</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дюрация</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставГрупповогоКонтроля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвестиционнаяДекларация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнвестиционныеДекларации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторРезультата</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДоговораДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_КонтрольИнвестиционныхДеклараций/Forms/ФормаЗагрузкиПретрейда/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОК(Команда)
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.СчетДоверительногоУправления) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить поле 'Счет доверительного управления'", , "СчетДоверительногоУправления");
		Возврат;
	
	КонецЕсли; 
	
	Если ЭтаФорма.ВидОперации = 1 И Не ЗначениеЗаполнено(ЭтаФорма.БрокерРасчетныйСчет) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить поле 'Брокер/расчетный счет'", , "БрокерРасчетныйСчет");
		Возврат;
	
	КонецЕсли;
	
	Если ЭтаФорма.ВидОперации = 0 Тогда
	
		ЭтаФорма.БрокерРасчетныйСчет = Неопределено;
	
	КонецЕсли; 
	
	КоличествоПустых = 0;
	МассивСтрок = Новый Массив;
	
	Для НомерСтроки = 1 По ЭтаФорма.ТабличныйДокумент.ВысотаТаблицы Цикл
	
		РегНомер = ЭтаФорма.ТабличныйДокумент.Область(НомерСтроки, 1, НомерСтроки, 1).Текст;
		
		Если КоличествоПустых > 20 Тогда
			Прервать;
		КонецЕсли; 
		
		Если РегНомер = "Рег. номер / ISIN" Тогда
			Продолжить;
		ИначеЕсли ПустаяСтрока(РегНомер) Тогда
			КоличествоПустых = КоличествоПустых + 1;
			Продолжить;		
		КонецЕсли; 		
		
		СтруктураКолонок = Новый Структура("Код, Количество, Цена, Купон, СчетДоверительногоУправления, БрокерРасчетныйСчет", 
			СтрЗаменить(СтрЗаменить(РегНомер, " ", ""), Символы.ПС, ""),
			СтрЗаменить(ЭтаФорма.ТабличныйДокумент.Область(НомерСтроки, 2, НомерСтроки, 2).Текст, " ", ""),
			СтрЗаменить(ЭтаФорма.ТабличныйДокумент.Область(НомерСтроки, 3, НомерСтроки, 3).Текст, " ", ""),
			СтрЗаменить(ЭтаФорма.ТабличныйДокумент.Область(НомерСтроки, 4, НомерСтроки, 4).Текст, " ", ""),
			ЭтаФорма.СчетДоверительногоУправления,
			ЭтаФорма.БрокерРасчетныйСчет); 
		
		МассивСтрок.Добавить(СтруктураКолонок);
	
	КонецЦикла; 
	
	ЭтаФорма.Закрыть(МассивСтрок);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "СчетДоверительногоУправления, Период") ;
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	НастроитьВидимостьДоступность(ЭтаФорма);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьДоступность(ЭтаФорма)
	ЭтаФорма.Элементы.ЦББрокерРасчетныйСчет.Видимость = (ЭтаФорма.ВидОперации = 1);
КонецПроцедуры

&НаКлиенте
Процедура ЦББрокерРасчетныйСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьСписокВыбораБрокерРасчетныйСчет(ЭтаФорма.СчетДоверительногоУправления, ЭтаФорма.Период);
	
КонецПроцедуры

&НаСервереБезКонтекста 
Функция ПолучитьСписокВыбораБрокерРасчетныйСчет(СчетДоверительногоУправления, Период)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РегистрСведенийКодыСчетовДоверительногоУправленияУБрокеров.Брокер КАК Брокер
		|ИЗ
		|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров КАК РегистрСведенийКодыСчетовДоверительногоУправленияУБрокеров
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&ТекущаяДата, ) КАК УсловияДоговоровОбщиеСрезПоследних
		|		ПО (УсловияДоговоровОбщиеСрезПоследних.Договор = РегистрСведенийКодыСчетовДоверительногоУправленияУБрокеров.ДоговорБрокерскогоОбслуживания)
		|ГДЕ
		|	(УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения > &ТекущаяДата)
		|	И РегистрСведенийКодыСчетовДоверительногоУправленияУБрокеров.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РегистрСведенийИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет
		|ИЗ
		|	РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК РегистрСведенийИсполнителиПоДенежнымСредствамСобственные
		|ГДЕ
		|	(РегистрСведенийИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ РегистрСведенийИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия >= &ТекущаяДата)
		|	И РегистрСведенийИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления = &СчетДоверительногоУправления";
	
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ТекущаяДата", Период);
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0));
	Возврат СписокЗначений;
	
КонецФункции
